## Data Cleaning and Stats

In [1]:
import numpy as np
import pandas as pd

In [37]:
df = pd.read_csv("melb_data.csv")

* Getting the sense of DataFrame

In [38]:
df.head(3)

,Unique ID,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,ID_1,Abbotsford,85 Turner St,2,h,1480000,S,Biggin,03-12-2016,2.5,...,1,1.0,202,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019
1,ID_2,Abbotsford,25 Bloomburg St,2,h,1035000,S,Biggin,04-02-2016,2.5,...,1,0.0,156,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019
2,ID_3,Abbotsford,5 Charles St,3,h,1465000,SP,Biggin,04-03-2017,2.5,...,2,0.0,134,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019

In [57]:
df.shape

(13580, 21)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unique ID      13580 non-null  object
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  int64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom2       13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13518 non-null  float64
 14  Landsize       13580 non-null  int64
 15  BuildingArea   7130 non-null   float64
 16  YearBuilt      8205 non-null   float64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
dtypes: float64(6), int64(7), object(9)
memory usage: 2.3+ MB

In [41]:
df.describe()

,Rooms,Price,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,Lattitude,Longtitude,Propertycount
count,13580.000000,1.358000e+04,13580.000000,13580.000000,13580.000000,13580.000000,13518.000000,13580.000000,7130.000000,8205.000000,13580.000000,13580.000000,13580.000000
mean,2.937997,1.075684e+06,10.137776,3105.301915,2.914728,1.534242,1.610075,558.416127,151.967650,1964.684217,-37.809203,144.995216,7454.417378
std,0.955748,6.393107e+05,5.868725,90.676964,0.965921,0.691712,0.962634,3990.669241,541.014538,37.273762,0.079260,0.103916,4378.581772
min,1.000000,8.500000e+04,0.000000,3000.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1196.000000,-38.182550,144.431810,249.000000
25%,2.000000,6.500000e+05,6.100000,3044.000000,2.000000,1.000000,1.000000,177.000000,93.000000,1940.000000,-37.856822,144.929600,4380.000000
50%,3.000000,9.030000e+05,9.200000,3084.000000,3.000000,1.000000,2.000000,440.000000,126.000000,1970.000000,-37.802355,145.000100,6555.000000
75%,3.000000,1.330000e+06,13.000000,3148.000000,3.000000,2.000000,2.000000,651.000000,174.000000,1999.000000,-37.756400,145.058305,10331.000000
max,10.000000,9.000000e+06,48.100000,3977.000000,20.000000,8.000000,10.000000,433014.000000,44515.000000,2018.000000,-37.408530,145.526350,21650.000000

### Changing the index col

In [42]:
df['Unique ID'] = df['Unique ID'].apply(lambda x : int(x[3:]))

In [43]:
df.sample(2)

,Unique ID,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
8245,8246,Prahran,303/10 Hillingdon Pl,2,u,645000,S,Gary,13-05-2017,4.5,...,1,1.0,2842,84.0,1920.0,Stonnington,-37.8513,144.99430,Southern Metropolitan,7717
9057,9058,Brunswick,18 Boase St,2,h,700000,PI,Nelson,03-06-2017,5.2,...,1,1.0,61,112.0,2007.0,Moreland,-37.7660,144.96076,Northern Metropolitan,11918

In [44]:
df = df.set_index("Unique ID")

In [45]:
df.sample(2)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
Unique ID,,,,,,,,,,,,,,,,,,,,,
12644,Balwyn,23 Nungerner St,3,h,2730000,S,Jellis,16-09-2017,7.9,3103,...,2,2.0,679,203.0,1940.0,NaN,-37.80576,145.06979,Southern Metropolitan,5682
7355,Ripponlea,23 Maryville St,4,h,1925000,PI,Marshall,27-11-2016,7.4,3185,...,2,3.0,485,NaN,NaN,Port Phillip,-37.87540,144.99440,Southern Metropolitan,821

* Finding the categorical features

In [46]:
cat_features = [feature for feature in df.columns if df[feature].dtypes == 'O']
cat_features

['Suburb',
 'Address',
 'Type',
 'Method',
 'SellerG',
 'Date',
 'CouncilArea',
 'Regionname']

* Checking number of nan values in categorical features

In [48]:
df[cat_features].isna().sum(axis=0)

Suburb            0
Address           0
Type              0
Method            0
SellerG           0
Date              0
CouncilArea    1369
Regionname        0
dtype: int64

* Dropping them as they cannot be replaced by a central tendency

In [70]:
df.drop(df[df['CouncilArea'].isna()].index, inplace=True)

* Filling the nan values in numerical features by interpolation

In [87]:
cols = df.columns[(df.isna().sum(axis=0)>=0)]
df[cols] = df[cols].interpolate()
df.fillna(value=df.mean(), inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12211 entries, 1 to 12213
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         12211 non-null  int32
 1   Address        12211 non-null  int32
 2   Rooms          12211 non-null  int64
 3   Type           12211 non-null  int32
 4   Price          12211 non-null  int64
 5   Method         12211 non-null  int32
 6   SellerG        12211 non-null  int32
 7   Date           12211 non-null  int32
 8   Distance       12211 non-null  float64
 9   Postcode       12211 non-null  int64
 10  Bedroom2       12211 non-null  int64
 11  Bathroom       12211 non-null  int64
 12  Car            12211 non-null  int8
 13  Landsize       12211 non-null  int64
 14  BuildingArea   12211 non-null  float64
 15  YearBuilt      12211 non-null  float64
 16  CouncilArea    12211 non-null  int32
 17  Lattitude      12211 non-null  float64
 18  Longtitude     12211 non-null  float64
 19  Regionname     12211 non-null  int32
 20  Propertycount  12211 non-null  int64
dtypes: float64(5), int32(8), int64(7), int8(1)
memory usage: 1.6 MB

* Label-Encoding the categorical features

In [73]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
df[cat_features] = df[cat_features].apply(lambda x:le.fit_transform(x))
print(df.dtypes)

Suburb             int32
Address            int32
Rooms              int64
Type               int32
Price              int64
Method             int32
SellerG            int32
Date               int32
Distance         float64
Postcode           int64
Bedroom2           int64
Bathroom           int64
Car              float64
Landsize           int64
BuildingArea     float64
YearBuilt        float64
CouncilArea        int32
Lattitude        float64
Longtitude       float64
Regionname         int32
Propertycount      int64
dtype: object

* Changing data types of Car to int8 to save memory

In [88]:
df['Car'] = df['Car'].astype("int8")
df['YearBuilt'] = df['YearBuilt'].astype("int8")

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12211 entries, 1 to 12213
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         12211 non-null  int32
 1   Address        12211 non-null  int32
 2   Rooms          12211 non-null  int64
 3   Type           12211 non-null  int32
 4   Price          12211 non-null  int64
 5   Method         12211 non-null  int32
 6   SellerG        12211 non-null  int32
 7   Date           12211 non-null  int32
 8   Distance       12211 non-null  float64
 9   Postcode       12211 non-null  int64
 10  Bedroom2       12211 non-null  int64
 11  Bathroom       12211 non-null  int64
 12  Car            12211 non-null  int8
 13  Landsize       12211 non-null  int64
 14  BuildingArea   12211 non-null  float64
 15  YearBuilt      12211 non-null  int8
 16  CouncilArea    12211 non-null  int32
 17  Lattitude      12211 non-null  float64
 18  Longtitude     12211 non-null  float64
 19  Regionname     12211 non-null  int32
 20  Propertycount  12211 non-null  int64
dtypes: float64(4), int32(8), int64(7), int8(2)
memory usage: 1.5 MB

### Mean, Median, Mode and Variance of the Rooms and Price features

In [94]:
df[['Rooms', 'Price']].mean()

Rooms    2.894194e+00
Price    1.063692e+06
dtype: float64

In [95]:
df[['Rooms', 'Price']].median()

Rooms         3.0
Price    895000.0
dtype: float64

In [96]:
df[['Rooms', 'Price']].mode()

   Rooms    Price
0      3  1100000

In [97]:
df[['Rooms', 'Price']].var()

Rooms    9.203357e-01
Price    4.081438e+11
dtype: float64